Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: འདི་ནི་གང་ཚེ་འཛུམ་ཞིང་རྒོད་པའི་ཚེ། །རོལ་མོའི་སྒྲ་སྙན་དེ་ཚེ་འབྱུང་བར་འགྱུར། །
en: {35} “ ‘Whenever she smiled or whenever she laughed, There arose the melodious sound of music.

source: བུད་མེད་རིན་ཆེན་འཇིག་རྟེན་འདིར་བྱུང་སྟེ། །ཐ་མལ་ཀུན་གྱི་དབང་དུ་འགྱུར་མ་ལགས། །
en: A precious female had appeared in this world Who would never be under the power of anyone ordinary.

source: ཁྱོད་མ་གཏོགས་པར་མི་ཡི་འཇིག་རྟེན་ན། །འདི་ཡི་བདག་པོ་གཞན་ནི་གཅིག་མ་མཆིས། །
en: {36} “ ‘There is no one else in this world Apart from yourself who could be her master.

source: མཚན་རབ་བརྒྱན་པའི་སྐུ་གཟུགས་མཛེས་མངའ་བ། །ཁྱོད་ཀྱི་ཞལ་སྔར་བུ་མོ་འདི་བཞེས་གསོལ། །
en: You who possess a beautiful body adorned by the signs, I pray you accept this girl who is before you.

source: འདི་ནི་ཧ་ཅང་མི་རིང་མི་ཐུང་སྟེ། །
en: {37} “ ‘She is not too tall and not too short.

source: ཧ་ཅང་མི་སྦོམ་ཧ་ཅང་ཕྲ་མ་ལགས། །
en: She is not too plump and not too thin.

source: ལྟོ་ནི་གཞུ་འདྲ་ནུ་མ་ཤས་ཀྱང་རྒྱས། །
en: Her waist is like a bow, and her breasts are large.

source: ཡན་ལག་སྐྱོན་བྲལ་འདི་ནི་ཁྱོད་ལ་འོས། །
en: Her limbs are faultless, and she is worthy of you.

source: གྲངས་དང་ཡི་གེ་ཤེས་བགྱི་ཚུལ་རྣམས་དང་། །ལག་བརྡའི་ཚུལ་དང་གཙུག་ལག་ཚུལ་ལ་མཁས། །
en: {38} “ ‘She is skilled in hand gestures and treatises And likewise in the ways of counting and writing.

source: འཇིག་རྟེན་ཀུན་ན་བཟོ་རྣམས་ཇི་སྙེད་པ། །མ་ལུས་དེ་ལ་འདི་ནི་ཕ་རོལ་ཕྱིན། །
en: She has perfected, without exception, All the arts there are in the world.

source: མདའ་གཞུའི་ཚུལ་ལ་འང་རྣམ་པ་རྒྱུས་སུ་མཁས། །འཕོང་གི་ཆོ་ག་རྣམ་པར་ངེས་པར་རྟོགས། །
en: {39} “ ‘She has complete knowledge of bows and arrows, And she has definitively mastered the art of archery.

source: དགྲ་ཡིད་བཞོང་ཞིང་དབབ་པ་ཀུན་ལ་ཡང་། །འདི་ནི་མཆོག་ཏུ་ཕ་རོལ་ཕྱིན་པར་གྱུར། །
en: She has attained supreme perfection in the ways Of attracting enemies and calming their minds.

source: ལུས་རྣམས་ཀུན་ལ་རིན་ཆེན་རྣམ་དག་པའི། །འོད་མཆོག་འཁོར་གྱིས་ཤིན་ཏུ་མཛེས་པ་སྟེ། །
en: {40} “ ‘Her entire body is perfectly adorned By a halo of a pure jewel’s supreme light.

source: སྔོན་བགྱིས་ལེགས་པས་ཤིན་ཏུ་སྡུག་པར་བརྒྱན། །
en: She is beautifully adorned through her past good actions.

source: འདི་ནི་ཁྱོད་ཀྱི་ཕྱག་རྗེད་ཁྱོད་ལ་འོས། །
en: She is worthy to be at your service.

source: མི་ཡི་འཇིག་རྟེན་གནས་རྣམས་ཇི་སྙེད་པ། །
en: {41} “ ‘She knows through the art of medicine how to heal All the illnesses in the human world.

source: དེ་དག་གསོ་བའི་ཚུལ་གྱི་ཆོ་ག་འཚལ། །དེ་དག་མ་ལུས་ཐམས་ཅད་ཞིར་བགྱི་ནའང་། །མ་ནོར་སྨན་གྱི་ཆོ་གས་གསོ་ལ་མཁས། །
en: She eliminates them without exception Through the correct practice of medicine.

source: འཛམ་བུའི་རྒྱལ་མཚན་སྐད་རྣམས་ཐམས་ཅད་དང་། །སྐྱེ་བོའི་ངེས་ཚིག་མ་ལུས་བྱེ་བྲག་དང་། །འཇིག་རྟེན་ཐ་སྙད་བརྗོད་པའི་མཚམས་སྦྱར་བ། །སྣ་ཚོགས་ཀུན་ལའང་འདི་ནི་ཕ་རོལ་ཕྱིན། །
en: {42} “ ‘She has also attained perfection in the various Languages throughout Jambudhvaja, Every specific definition of beings without exception, And the application of terminologies in the world.

source: དབྱངས་ཀྱི་ཡན་ལག་མངོན་པར་བསྒྲུབ་པའི་ཚུལ། །དེ་དག་བྱེ་བྲག་ཚུལ་ལའང་རབ་ཏུ་ཞུགས། །
en: {43} “ ‘She has comprehended the ways of the categories Of accomplishing the different aspects of the voice.

source: འཇིག་རྟེན་གླུ་གར་རྣམ་པ་ཇི་སྙེད་པ། །མ་ལུས་དེ་རྣམས་ཀུན་གྱི་ཚུལ་ཡང་འཚལ། །
en: She knows the ways of all singing and dancing Without exception that are to be found in this world.

source: རོལ་མོ་སིལ་སྙན་དག་གི་ཐབས་རྣམས་དང་། །བཞད་གད་རོལ་མོའི་ཚུལ་ལ་རྣམ་པར་མཁས། །
en: {44} “ ‘She comprehends the methods of drumming and music And of comedic and dramatic performances.

source: ཆགས་དང་མ་ཆགས་མི་རྣམས་མངོན་འཚལ་ཀྱང་། །ཁོང་ཁྲོ་ཆགས་པར་འགྱུར་བ་མ་མཆིས་སོ།
en: Though she knows men who are passionate and those who are not, She herself has neither desire nor anger toward them.

source: འཇིག་རྟེན་བུད་མེད་སྒྲ་རྣམས་ཇི་སྙེད་པ། །ཁྱད་པར་ནང་དུ་དེ་ལ་མ་ལུས་འཚལ། །
en: {45} “ ‘She knows without exception all the different Uses of the voice by women in the world.

source: བུད་མྱེད་སྐྱེ་བོའི་སྐྱོན་དུ་བགྱི་བ་རྣམས། །གྲངས་མེད་དེ་དག་འདི་ལ་གཅིག་མ་མཆིས། །
en: She does not have even a single one Of the countless faults of women.

source: ཐིལ་གྱིས་བལྟ་དང་ཟུར་གྱིས་བལྟ་བ་དང་། །ཡན་ལག་སྟབས་དང་ཡན་ལག་རྣམས་བསྟན་དང་། །ཤེས་ཉེན་ཀུན་ལ་མཁས་པའི་མཐར་ཕྱིན་ཏེ། །
en: {49} “ ‘She has fully mastered the skill in all the arts Of the direct gaze, the sideways gaze, Giving her body, and revealing her body.

source: ཁྱོད་ཀྱི་དགོངས་པ་ཡོངས་སུ་རྫོགས་པར་བགྱིད། །
en: She will completely fulfill your heart’s desires.

source: འདི་ནི་ཕྲག་དོག་སེར་སྣ་མ་མཆིས་ཏེ། །
en: {47} “ ‘She is not jealous; she is not greedy.

source: འདོད་པ་ཞེ་དུག་མི་ལྡང་སྡིག་མི་བགྱིད། །
en: She does not indulge in desires or commit bad actions.

source: བཟོད་ཅིང་དྲང་ལ་མཉེན་ཞིང་དེས་པ་སྟེ། །
en: She is patient, honest, gentle, and tender.

source: མི་ཁྲོ་མི་བརླང་ཤིན་ཏུ་མཁས་པ་ལགས། །
en: She is not angry, she is not harsh, and she is very wise.

source: ལྡང་བའི་ངང་ཚུལ་ཡིད་དུ་འོང་བའི་ངག །
en: {48} “ ‘She is ever ready and speaks agreeably.

source: རྟག་ཏུ་བླ་མའི་ཐུགས་དང་སྦྱོར་བ་སྟེ། །
en: She is always obedient to her gurus.

source: སྐུ་ཉམས་གར་བདེ་ལྟ་ཞིང་སྲིད་ཞུ་ཆེ། །
en: Her behavior is always pleasant and very respectful.

source: ཁྱོད་ཀྱི་སྤྱོད་མཐུན་རྗེས་སྙེགས་ཚུལ་དང་མཐུན། །
en: She will appropriately be in harmony with your conduct.

source: རྒས་ཤིང་གཏུགས་དང་ནད་དང་ལྡན་པ་དང་། །ཕོངས་པ་ཤིན་ཏུ་སྡུག་བསྔལ་གྱུར་པ་དང་། །མིག་དང་བྲལ་ཞིང་མགོན་སྐྱབས་མ་མཆིས་ལ། །འདི་ནི་སྙིང་བརྩེ་རྟག་ཏུ་བསྐྱེད་པ་ལགས། །
en: {49} “ ‘She always has compassion for those Who have become aged and who are ill, Who are destitute and who are suffering, Who are blind and have no one to care for them.

source: འདི་ནི་རྟག་ཏུ་གཞན་དོན་སེམས་ལ་བརྩོན། །
en: {50} “ ‘Her mind is always dedicated to benefiting others.

source: བདག་ལ་སྨན་པ་སེམས་པར་བགྱིད་མ་མཆིས། །
en: She never thinks of benefits for herself.

source: འཇིག་རྟེན་ཀུན་ལ་སྨན་པར་དགའ་བ་སྟེ། །
en: She rejoices in benefiting the entire world.

source: རླབས་ཆེན་སེམས་ཀྱི་ཡོན་ཏན་ཀུན་གྱིས་བརྒྱན། །
en: She is adorned with vast qualities of the mind.

source: མཆིས་སམ་ཉལ་ལ་མ་མཆིའམ་འགྲེང་ཡང་རུང་། །སྨྲའམ་མི་སྨྲ་འཛུམ་ཞིང་རྒོད་ཀྱང་རུང་། །རྟག་ཏུ་བག་མཆིས་དྲན་པ་ཤེས་བཞིན་ཏེ། །འདི་ནི་འཇིག་རྟེན་ཀུན་གྱིས་རྟག་ཏུ་བསྔགས། །
en: {51} “ ‘She is always attentive, mindful, and circumspect, Whether standing, sitting, lying down, or walking, Whether speaking or silent, smiling or laughing, And she is always praised by the whole world.

source: བསོད་ནམས་ལྡན་པས་ཀུན་ཏུ་རྣམ་པར་སྣང་། །འགྲོ་བ་ཀུན་ཀྱང་རྟག་ཏུ་དགའ་བ་སྟེ། །འདི་ལ་ལྟ་བས་འཇིག་རྟེན་ངོམས་མྱི་འགྱུར། །འདི་ནི་གང་ལའང་ཆགས་པར་མ་མཆིས་ལགས། །
en: {52} “ ‘She always appears to be meritorious, She is always beloved by all people, Who never have enough of gazing upon her, And she has no attachment to anything in the world.

source: དགེ་བཤེས་རྣམས་ལ་སྲི་ཞུ་འདི་ཆེ་སྟེ། །དེ་དག་མཐོང་བར་རྟག་པར་རབ་ཏུ་དགའ། །
en: {53} “ ‘She is respectful to kalyāṇamitras, And she is always happy to see them.

source: རྗེས་སུ་ཅི་འབྱུང་ལྟ་ཞིང་སྐྱོན་མེད་ཚུལ། །
en: She looks far ahead, and her intentions are faultless.

source: སེམས་བདག་བརྟན་པ་རི་རབ་རི་དང་འདྲ། །
en: Her pure mind is as stable as Sumeru.

source: འདི་ནི་བསོད་ནམས་མཆོག་གིས་རྟག་ཏུ་བརྒྱན། །
en: {54} “ ‘She is always adorned by her excellent merit.

source: མི་མཛའ་དགྲར་ལེན་འདི་ལ་ཡོད་མ་མཆིས། །
en: She does not see anyone as being her enemy.

source: འདིའི་ཤེས་འདྲ་བུད་མྱེད་གཅིག་མ་མཆིས། །
en: There is no woman who has her kind of wisdom.

source: རྒྱལ་སྲས་ཁྱོད་ལ་འདི་ནི་ཚུལ་དང་འཐུན།། །།སངས་རྒྱས་རྨད་ག་ཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་བཅོ་ལྔ་བ།
en: Prince, she would be a suitable match for you.’

source: དེ་ནས་རྒྱལ་བུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་བཟའ་ཤིང་གི་ར་བ་སྤོས་ཀྱི་མྱུ་གུའི་རྩེ་མོ་ལས་འོད་ཀྱི་སྤྲིན་འབྱུང་བར་ཕྱིན་ཏེ། །བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པའི་མ་སྤྲུལ་འཚོང་མའི་གཙོ་མོ་བལྟ་ན་སྡུག་པའི་མདུན་དུ། བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བུ་མོ་ང་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་པ་ཡིན་ཏེ།
en: {55} “Then Prince Tejodhipati came to Gandhāṅkura­prabha­megha, and, in the presence of Sudarśanā, the preeminent courtesan, who was the mother of Sucalita­rati­prabhāsa­śrī, he said to Sucalita­rati­prabhāsa­śrī, ‘Girl, I have undertaken to attain the highest, complete enlightenment.

source: དེ་བས་ན་ངས་ཐམས་ཅད་མཁྱེན་པའི་ཚོགས་ནི་ཚད་མྱེད་པ་ཞིག་བསྩགས་པར་བྱ་དགོས་བསྐལ་པ་མཐའ་དང་དབུས་མེད་པ་ཞིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་སྦྱད་པ་སྤྱོད་དེ།
en: Therefore, I have to gather an immeasurable accumulation of omniscience.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ནི་ཡོངས་སུ་རྫོགས་པར་བྱ་དགོས།
en: Throughout kalpas with no end or middle I must practice bodhisattva conduct and complete all the perfections.

source: ཕྱི་མའི་མཐའི་བསྐལ་པའི་མུར་ཐུག་པར་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་མཆོད་པར་བྱ་དགོས་ཏེ།
en: I must make offerings to the tathāgatas until the very last of future kalpas.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བསྟན་པ་ནི་ཡོངས་སུ་གཟུང་བར་བྱ།
en: I shall obtain the teachings of all the buddhas.

source: སངས་རྒྱས་ཀྱི་ཞིག་ཐམས་ཅད་ནི་ཡོངས་སུ་སྦྱང་པར་བྱ།
en: I shall purify all buddha realms.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ནི་མི་གཅད་པར་བྱ།
en: I shall not be separated from the families of all tathāgatas.

source: སེམས་ཅན་གྱི་རྒྱུད་ཐམས་ཅད་ནི་ཡོངས་སུ་སྨྱིན་པར་བྱ།
en: I shall ripen all the families of beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཁོར་བའི་སྡུག་བསྔལ་ནི་རྣམ་པར་བཟློག་པར་བྱ།
en: I shall dispel the suffering of saṃsāra for all beings.

source: མཐའ་ལས་རྒལ་བར་བདེ་བ་ལ་ནི་སེམས་ཅན་རབ་ཏུ་དགོད་པར་བྱ།
en: I shall bring beings to a bliss that is beyond all limits.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་ཀྱི་མྱིག་ནི་ཡོངས་སུ་དག་པར་བྱ།
en: I shall purify the eyes of wisdom of all beings.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་བསྒྲུབ་པ་ལ་ནི་བརྩོན་པར་བྱ།
en: I shall be dedicated to the accomplishments of all bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ལ་ནི་གནས་པར་བྱ།
en: I shall rest in the equanimity of all bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ས་ནི་ཡོངས་སུ་བསྒྲུབ་པར་བྱ།
en: I shall accomplish the bhūmis of all bodhisattvas.

source: སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ནི་ཡོངས་སུ་སྦྱང་བར་བྱ།
en: I shall purify the realms of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕོངས་པ་ཡོངས་སུ་གཙང་པའི་ཕྱིར་བདག་གི་ནོར་ཐམས་ཅད་ནི་གཏང་བར་བྱ།
en: I shall give away all my wealth so as to eliminate the poverty of all beings.

source: ཕྱི་མའི་མཐའི་མུར་ཐུག་པའི་བསྐལ་པར་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་ལ་སྤྱོད་པའི་ཚེ། ཁ་ཟས་དང་། བཏུང་བའི་སྦྱིན་པས་ནི་སེམས་ཅན་ཡོངས་སུ་ཚིམ་པར་བྱ། ཡོ་བྱད་ཀྱི་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བས་ནི་སློང་བའི་ཚོགས་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱ་དགོས་ཏེ།
en: “ ‘While I am practicing the perfection of generosity until the last future kalpa, I shall satisfy beings with the gift of food and drink, and through the gift of all kinds of artifacts I must bring satisfaction to all assemblies of supplicants.

source: དེ་ལྟར་ང་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་པ་ལ་ནན་ཏན་ཉམས་སུ་ལེན་པའི་ཚེ། ཕྱི་ནང་གི་དངོས་པོ་གང་ཅི་རུང་སྟེ།
en: “ ‘While I am in that way practicing the dedication to giving away everything, there will be nothing internal or external that I will not give away.

source: ཡོངས་སུ་མི་གཏང་བ་དེ་ལྟ་བུ་མེད་པས་དེ་ལྟར་ངས་བུ་དང་བུ་མོ་དང་། ཆུང་མ་ཡང་སྦྱིན་པར་བྱ་དགོས།
en: Therefore, I will have to give away even my sons, daughters, and wives.

source: མྱིག་དང་མགོ་དང་རྐ་ལག་དང་། ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་གཏང་དགོས་ན། །
en: I will have to give away my eyes, head, legs, arms, and the greater and smaller parts of my body.

source: དེའི་ཚེ་ཁྱོད་གཞན་བྱིན་ན། ངའི་སྦྱིན་པའི་བགེགས་སུ་འགྱུར་རོ། །
en: “ ‘At that time, you would become an obstacle to my generosity of giving to others.

source: བུ་ཡིད་དུ་འོང་བ་ཡོངས་སུ་གཏང་ན་ཡིད་མི་དགའ་བར་འགྱུར་རོ། །
en: You would become unhappy when I give away our beautiful sons.

source: ལུས་དང་སེམས་ཀྱི་སྡུག་བསྒལ་ཡང་མང་པོ་ཞིག་ཉམས་སུ་མྱོང་བར་འགྱུར་རོ། །
en: You would experience much physical and mental suffering.

source: ང་ལ་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བར་བྱས་ན་སེར་སྣའི་སེམས་སུ་འགྱུར་རོ། །
en: When I give away everything, you would become miserly.

source: ངའི་ཡན་ལག་དང་ཉིང་ལག་གཏུབས་ཤིང་སློངས་མོ་པ་རྣམས་ལ་གཏོང་བའི་ཚེ། ཡིད་མི་དགའ་བར་ཡང་འགྱུར་རོ། །
en: When I cut off the greater and smaller parts of my body and give them to supplicants, you would become unhappy.

source: ནམ་ཞིག་ན་ངས་ཁྱོད་བོར་ཏེ་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་དུས་ཀྱང་ཡོད་དེ།
en: There will also come a time when I would abandon you and enter homelessness within the teaching of a tathāgata.

source: དེའི་ཚེའང་ཁྱོད་ཡིད་མི་དགའ་བར་འགྱུར་རོ། །
en: At that time you would become unhappy.’

source: ཞེས་ནས་རྒྱལ་བུ་གཟི་བརྗིད་ཀྱི་བདག་བོས་དེའི་ཚེ། བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། །ངས་ནི་འགྲོ་ཀུན་སྙིང་རྗེ་རབ་བསྐྱེད་དེ། །
en: “Then, at that time, Prince Tejodhipati recited these verses to the girl Sucalita­rati­prabhāsa­śrī: “ ‘I have developed compassion for all beings.

source: ཡུན་རིང་མཆོག་ནས་བྱང་ཆུབ་རབ་ཞུགས་པས། །
en: For a long time I have been set on enlightenment.

source: ཡང་དག་བྱང་ཆུབ་ཚོགས་ཆེན་རྒྱ་མཚོ་རྣམས། །ཚད་མེད་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་བྱ་དགོས། །
en: I must complete all the limitless oceans Of the great accumulations for true enlightenment.

source: བསྐལ་པ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མྱེད་པར། །མཁའ་ལྟར་ཚད་མྱེད་སྨོན་ལམ་རྣམ་སྦྱངས་ཤིང་། །
en: {56} “ ‘For an ocean of kalpas that has no edge or middle, As measureless as space, I have purified my prayers.

source: དེ་བཞིན་གཤེགས་པ་བཞུགས་པའི་ས་ཡི་རྣམས། །བསྐལ་པ་མཐའ་ཡས་ཡོངས་སུ་སྦྱངས་ཡང་དགོས། །
en: I must completely purify throughout endless kalpas The bhūmis on which the tathāgatas reside.

source: རྒྱལ་བ་དུས་གསུམ་འབྱུང་བ་ཐམས་ཅད་ཀྱི། །ཕ་རོལ་ཕྱིན་པའི་ལམ་ལ་ངས་བསླབས་ཏེ། །
en: {57} “ ‘I will train in the path of the perfections Of all the jinas who appear in the three times.

source: ཡེ་ཤེས་བླ་ན་མེད་པའི་ཚུལ་ཆེན་གྱིས། །བྱང་ཆུབ་ལམ་མཆོག་རྣམ་པར་སྦྱངས་ཡང་དགོས། །
en: I must purify the supreme path to enlightenment Through the great way of the highest wisdom.

source: ཕྱོགས་རྣམས་ཀུན་གྱི་ཞིང་རྣམས་ཐམས་ཅད་ཀྱང་། །ཀུན་ནས་ཉོན་མོངས་རྣམ་པར་སྦྱང་བར་བྱ། །
en: {58} “ ‘I will completely purify of defilements All the realms that are in every direction.

source: འཇིག་རྟེན་ཀུན་གྱི་མི་ཁོམ་ཐམས་ཅད་དང་། །ངན་སོང་ཀུན་ཀྱང་རྣམ་པར་བཟློག་དགོས་སོ། །
en: I must dispel all unfortunate states in worlds And even all the lower existences.

source: ཉོན་མོངས་བསྒྲིབས་ཤིང་གཏི་མུག་མུན་འཐོམས་པའི། །སེམས་ཅན་ཀུན་ཀྱང་མ་ལུས་རྣམ་སྦྱང་དགོས། །
en: {59} “ ‘I must purify every being, without exception, Enveloped in the darkness of ignorance and obscured by kleśas.

source: སྣ་ཚོགས་ཐབས་ཀྱིས་ཡོངས་སུ་སྦྱང་བྱས་ཏེ། །ཐམས་ཅད་མཁྱེན་ལ་ཚུལ་ལ་དགོད་ཀྱང་དགོས། །
en: I must purify them through various methods And bring them into the way of the path to omniscience.

source: ཆགས་མེད་ས་རྣམས་ཀུན་ཀྱང་ངས་སྦྱངས་ཏེ། །བསྐལ་པ་རྒྱ་མཚོར་རྒྱལ་བ་མཆོད་པར་བྱ། །
en: {60} “ ‘I shall purify all the levels of nonattachment And make offerings to the jinas for an ocean of kalpas.

source: འགྲོ་བ་མ་ལུས་ཀུན་ལ་བྱམས་བསྐྱེད་དེ། །འཇིག་རྟེན་དག་ཏུ་མ་ལུས་སྦྱིན་གཏང་དགོས། །
en: I had developed love for all beings without exception, And I must give away everything in the world.

source: སློང་བ་ཀུན་ནས་འདུས་ཤིང་འོངས་མཐོང་ནས། །ཐམས་ཅད་གཏང་བར་རྟག་ཏུ་བརྩོན་གྱུར་ན། །
en: {61} “ ‘When I see supplicants gathering and coming, I will dedicate myself to giving away everything.

source: དེ་ཚེ་ཁྱོད་ནི་ང་སེམས་མི་འཐུན་ཏེ། །ཞུམ་ཞིང་དམའ་ལ་འཇུངས་པར་མི་འགྱུར་རམ། །
en: At that time won’t you be in disagreement with me And become saddened and be downcast?

source: ངའི་མགོ་འདོད་འོངས་པ་ངས་མཐོང་སྟེ། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་གྱུར་ན། །དེ་ཚེ་ཁྱོད་ནི་སྡུག་བསྔལ་བ་གདུངས་གྱུར་གྱིས། །
en: {62} “ ‘When I see someone come who wants my head, And if I then practice bodhisattva conduct, You will at that time be tormented by suffering.

source: འདི་འདྲའི་དོན་ཐོས་རབ་ཏུ་བསྟན་པར་གྱིས། །
en: Listen to what I tell you and be resolute.

source: ངའི་རྐ་ལག་གཏུབས་པ་མཐོང་གྱུར་ན། །ཁྱོད་ནི་མི་དགའ་དེ་ཚེ་སློང་བ་ལ། །
en: {63} “ ‘When you see my legs and arms cut off, At that time you will be distressed.

source: བུད་མྱེད་ངང་གིས་ཚིག་དྲག་མི་བཟོད་སྨྲ། །
en: And you the woman will hear dreadful, harsh things.

source: དོན་འདི་ཐོསཤིང་སེམས་ལ་ཡོངས་སུ་སོམས། །
en: Listen to what I say and consider it.

source: འཕགས་པའི་དངོས་དག་དེ་བཞིན་བུ་རྣམས་དང་། །ཁྱོད་ཀྱང་སློང་བའི་ཚོགས་ལ་སྦྱིན་དགོས་ཀྱིས། །
en: {64} “ ‘I will have to give away the highest material things, and similarly My children and even you, to the crowds of supplicants.

source: དོན་འདི་ཐོས་ཏེ་མི་དགའ་མྱེད་ན་ལྟ། །
en: On hearing this, see if it does not sadden you.

source: ཁྱོད་དགའ་ཐམས་ཅད་དེ་བཞིན་བྱ་ལ་རག། དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: All that you wish for depends on that.’

source: བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པས། རྒྱལ་བུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གཞོན་ནུ་ཇི་སྐད་གསུངས་པ་དེ་ལྟར་བགྱིའོ། །
en: {65} “Then the girl Sucalita­rati­prabhāsa­śrī said to Prince Tejodhipati, ‘Prince, may it be just as you have said, and I will do whatever you want.

source: བདག་ནི་ཁྱོད་ཅི་དགྱེས་པ་དང་། །ཅི་བཞེད་པར་ལོངས་སྤྱོད་པ་དང་།
en: I will enjoy whatever you wish.

source: གང་དུ་དགྱེས་པར་མཆི་བ་དང་། ཐམས་ཅད་དུ་ཡང་སླད་ནམ་ལས་པར་རྗེས་སུ་འབྲང་བ་དང་།
en: Wherever you wish to go, I will follow you everywhere.

source: རྟག་ཏུ་ཞམ་རིང་སླེབས་པ་དང་། དོན་ཐམས་ཅད་ལ་བརྩོན་པ་དང་། ཐུགས་དང་འཐུན་པར་སྤྱད་པ་དང་། མེད་པར་ཉམས་སུ་བླང་བ་དང་། །མི་འཐུན་པ་མ་མཆིས་བར་ནན་ཏན་ཏུ་བགྱི་བའི་ཚུལ་ལ་སྤྱད་པར་བགྱིའོ། །
en: I will always be in your presence, I will be dedicated to your goals, I will act in harmony with you, and I will practice sincerely; my conduct will be engaged in practicing that which accords with you.’

source: ཞེས་ནས་བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པས། རྒྱལ་པོའི་སྲས་གཟི་བརྗིད་ཀྱི་བདག་པོ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། བདག་གི་ལས་འདི་སེམས་ཅན་དམྱལ་བ་ཡི། །ཞུགས་ཀྱིས་ཡོངས་སུ་གདུངས་ཞུ་བར་གྱུར་ཀྱང་རུང་། །ཁྱོད་སྤྱོད་སྐལ་བ་མཉམ་པའི་ཕྱག་རྗེད་དུ། །
en: “Then the girl Sucalita­rati­prabhāsa­śrī recited these verses to Prince Tejodhipati: “ ‘Even though my body is destroyed By being incinerated in the fires of hell, I will have the fortitude to assist you In our common practice during an ocean of lifetimes.

source: ཚེ་རབས་རྒྱ་མཚོར་བདག་གི་སྤྲོ་བར་བགྱི། །ཚེ་རབས་མཐའ་ཡས་སྐྱེས་པ་རེ་རེ་ཞིང་། །བདག་གི་ལས་ནི་ཤིན་ཏུ་གཏུབས་གཤགས་ཀྱང་། །བརྟན་དམ་སེམས་ཀྱིས་རབ་ཏུ་སྤྲོ་བར་བགྱིས། །དད་དགེ་ཁྱོད་ཀྱིས་བདག་གི་ཁྱིམ་ཐབ་མཛོད། །
en: {66} “ ‘Even though my body is chopped up In each rebirth in endless lifetimes, I will be resolute in my fortitude To have you, virtuous one, as my husband.

source: ཁོར་ཡུག་རི་ཡིས་བསྐལ་པ་མཐའ་ཡས་སུ། བདག་གི་མགོ་ནི་ཡོངས་སུ་བཏགས་གྱུར་ཀྱང་། །སེམས་ལ་མི་བདེ་མ་མཆིས་དད་པར་བགྱིད། །ཁྱོད་ཀྱིས་རྟག་པར་བདག་གི་ཁྱིམ་ཐབ་མཛོད། །
en: {67} “ ‘Even though, for endless kalpas, my head Is crushed by the Cakravāla mountains, I would not be unhappy but would have faith in you, And you would always be my spouse.

source: ཁྱོད་ཀྱིས་ཚེ་རབས་གྲངས་མེད་ཐམས་ཅད་དུ། །བདག་ལ་ཐུགས་བརྟན་ཐུགས་ཀྱིས་མངའ་མཛད་དེ། །ལན་ལག་ཤ་གཏུབས་གཞན་ལ་སྩལ་བར་མཛོད། །ཁྱོད་ཀྱི་ཆོས་ལ་བདག་ཀྱང་བརྟན་གཞག་གསོལ། །
en: {68} “ ‘Within all our countless lifetimes, Give me mental stability and control over my own mind, And cut off my limbs and give them to others: I pray that you establish me firmly in your Dharma.

source: བདག་གི་ལས་ནི་སླད་ན་མ་ལས་པར། །སྐྱེས་བུ་ལྷ་ཡི་སྲས་པོ་ཁྱོད་ལ་དབུལ། །
en: {69} “ ‘All my successive bodies, without exception, I offer to you, a divine man.

source: བསྐལ་པ་རྒྱ་མཚོར་སྤྱོད་པ་མཛད་པའི་ཚེ། །སྐྱེ་བོ་སློང་བ་རྣམས་ལ་དགྱེས་པར་གསོལ། །
en: When you practice the conduct in an ocean of kalpas, I pray you use it to please the supplicants.

source: སེམས་ཅན་ཀུན་ལ་ཐུགས་རྗེ་མཐའ་ཡས་པ། །བསྐྱེད་དེ་སེམས་ཅན་རྒྱ་མཆོ་བསྡུ་སླད་དུ། །
en: {70} “ ‘You developed endless compassion for all beings In order to gather together an ocean of beings.

source: བྱང་ཆུབ་དམ་པ་མཆོག་ཏུ་ཁྱོད་བཞུགས་པས། །དེ་སླད་བདག་ཀྱང་ཐུགས་རྗེས་གཟུང་བ་མཛོད། །
en: You are set on attaining supreme, perfect enlightenment, So from now on hold me too in your compassion.

source: ལོགས་སྤྱོད་དོན་དང་ནོར་གྱི་དོན་མ་ལགས། །འདོད་སྤྱོད་དགའ་བ་བསྐྱེད་པའི་དོན་སླད་དུ། །སེམས་ཅན་མཆོག་ཁྱོད་ཁྱོར་འཚལ་མ་ལགས་ཀྱི། །ཁྱོད་དང་སྦྱོང་པ་འཐུན་པར་སྤྱད་སླད་དུའོ། །
en: {71} “ ‘I desire you, the supreme being, as a husband, Not for the sake of possessions, not for the sake of wealth, And not for the sake of enjoying sensual pleasures But in order to practice the same conduct as you.

source: སྤྱན་གསལ་མཛེས་ཤིང་བྱམས་པའི་ཐུགས་མངའ་བ། །ཁྱོད་ནི་འཇིག་རྟེན་གཟིགས་པ་ཅི་ཚུལ་ལགས། །ཐུགས་རྗེ་ཆེ་ཡི་འདོད་ཆགས་ཐུགས་མི་མངའ། དེ་ལ་ཐུབ་དབང་འགྱུར་བ་གདོན་མི་འཚལ། །
en: {72} “ ‘The way in which you look upon the world Is with clear, beautiful eyes and a mind of love, With great compassion and a mind free of passion: Lord of sages, I have no doubt in you.

source: ཁྱོད་ཀྱི་ཞབས་ཀྱིས་བཅགས་པའི་ས་རྣམས་ཀྱང་། །དྲི་མེད་རིན་ཆེན་འོད་དུ་གནས་པ་ལས། །
en: {73} “ ‘The ground upon which you have trod Has become stainless with the light of jewels.

source: ཁམས་གསུམ་ཀུན་ཏུ་འཁོར་ལོས་སྒྱུར་བར་ཡང་། །མཚན་རབ་ཡོངས་ཀྱིས་བརྒྱན་བྱོན་གདོན་མི་འཚལ། །
en: You are adorned with the signs, and there is no doubt That you will be a cakravartin in all three realms.

source: བདག་གིས་གཡར་ལམ་མཐོང་བ་དགུང་ཞིག་ལ། །ཆོས་བཟང་སྤྲིན་འོད་བྱང་ཆུབ་སྙིང་པོ་ཡི། །ཤིང་དབང་དྲུང་ན་དེ་བཞིན་གཤེགས་པ་བཞུགས། །སངས་རྒྱས་སྲས་མང་དུ་མས་མདུན་དུ་བདར། །
en: {74} “ ‘I have seen in a dream A tathāgata at the foot of the lord of trees At the bodhimaṇḍa Sudharma­megha­prabhā, With many sons of the buddhas before him.

source: རྒྱལ་པའི་དབང་པོ་སྐུ་མཆོག་ཉི་མ་དེ། །འཛམ་བུ་ཆུ་ཀླུང་རིན་ཆེན་འཚེར་བ་འདྲ། །གཡར་ལམ་མཐོང་བར་ཕྱག་གིས་བདག་མགོ་བྱུག །དེ་ནས་སང་ནས་གློ་བ་རབ་ཏུ་དགའ། །དགའ་བའི་འོད་ཅེས་བགྱི་བ་རྣམ་དག་ལུས། །
en: {75} “ ‘Sūrya­gātra­pravara, lord of jinas, Shining like precious Jambu River gold— I saw him in a dream stroking my head, And so today was filled with joy.

source: སྔན་ཆད་གཉེན་བཤེས་གྱུར་པའི་ལྷ་མོ་ཡིས། །བདག་ལ་བསྟན་པ་བདེ་གཤེགས་དེ་ཉིད་ནི། །སྙིང་པོ་ཡང་དག་བྱང་ཆུབ་ཡོངས་ལ་ཞུགས། །
en: {76} “ ‘A goddess with a pure body Named Ratiprabhā, a relative in the past, Proclaimed to me that this tathāgata Was present at the bodhimaṇḍa.

source: སྔོན་ཡང་གཞོན་ནུ་གཟི་བརྗིད་ཁྱོད་བལྟ་ཞེས། །བདག་གི་སེམས་བསྐྱེད་དེ་ལྟར་བསམ་པར་གྱུར། །
en: {77} “ ‘Before that I developed the aspiration Of thinking I shall see you, Prince Tejodhipati.

source: མདང་སུམ་དགུང་ལ་ལྷ་མོ་དགེ་བ་ཡིས། །གཞོན་ནུ་དེ་ནི་མཐོང་བར་འགྱུར་ཞེས་བསྟན། །
en: The goddess proclaimed to me, “You will see that prince today!”

source: བདག་གི་བདེ་གཤེགས་གཡར་ལམ་རྨྱིས་པས་མཐོང་། །ཡོངས་སུ་དག་པའི་སེམས་ཅན་ཁྱོད་ཀྱང་མཐོང་། །
en: {78} “ ‘I dreamed of seeing the sugata, And I also saw you, a pure being.

source: ཡིད་བཞིན་བསམ་གྲུབ་ཁྱོད་དང་བདག་བཅས་པས། །དེ་རིང་རྒྱལ་བ་དེ་ལ་མཆོད་པར་བགྱི། །
en: You, a wish-fulfilling jewel, and I Will today make offerings to that jina.’

source: དེ་ནས་རྒྱལ་པོའི་བུ་གཟི་བརྗིད་ཀྱི་བདག་པོས། དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པའི་མཚན་ཐོས་ཏེ། སངས་རྒྱས་བལྟ་བའི་སྐབས་བྱུང་ནས་དགའ་བ་དང་མོས་པའི་ཤུགས་ཆེན་པོ་སྐྱེས་ཏེ།
en: {79} “Then Prince Tejodhipati, on hearing the name of the Tathāgata Sūrya­gātra­pravara, developed a powerful great aspiration and joy on having gained the opportunity to see that buddha.

source: བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་ལ་ནོར་བུ་རིན་པོ་ཆེ་ལྔ་བརྒྱས་མངོན་བར་གཏོར་ནས། གཙུག་གི་རིན་པོ་ཆེ་དཔལ་གྱི་འོད་འབར་བ་ཞེས་བྱ་བ་ཡང་དེ་ལ་བྱིན་ནོ། །མྱེའི་མདོག་ལྟར་འདུག་པའི་ནོར་བུ་རིན་པོ་ཆེ་དམ་པས་བརྒྱན་པའི་གོས་རིན་པོ་ཆེས་ཀྱང་དེ་བཀབ་པོ། །
en: He scattered five hundred jewels on the girl Sucalita­rati­prabhāsa­śrī, gave her his crest jewel called glorious shining light, and covered her with precious clothing the color of fire and adorned her with excellent precious jewels.

source: དེ་དེ་ལྟར་རིམ་གྲོར་བྱས་ཀྱང་དགའ་བར་གྱུར་པའམ། །ཉམས་བདེ་བར་གྱུར་པ་ལྟ་བུའང་མེད་ལ་དགའ་བ་དང་མོས་པར་ཡང་མ་གྱུར་གྱི། གཞན་དུ་ན་ཐལ་མོ་སྦྱར་ཅིང་མྱིག་མི་འགེབས་པར་གཞོན་ནུ་གཟི་བརྗིད་བདག་གི་གདོང་ལ་བལྟ་ཞིང་གནས་བར་གྱུར་ཏོ། །
en: “Though she was honored in that way, she did not delight or rejoice in it or become overjoyed, but with her hands together in homage remained gazing with her eyes fixed upon the face of Prince Tejodhipati.
